In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

In [13]:
dataset_name = 'ds_salaries'
df1 = pd.read_csv(f'data/{dataset_name}.csv')
df2 = pd.read_csv(f'data/{dataset_name}_2.csv')

In [6]:
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [7]:
df2

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [14]:
att_to_delete = [df2.columns[0],'salary_in_usd']
#Eliminem atributs innecesaris
df1 = df1.drop('salary_in_usd', axis='columns')
df2 = df2.drop(att_to_delete, axis='columns')
#Con concatenem els datasets
df = pd.concat([df1, df2], ignore_index=True)
print(df.duplicated().sum())
df.drop_duplicates(inplace=True)

1764

In [15]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...
3940,2021,MI,FT,Data Engineer,4000,USD,IR,100,IR,M
3987,2021,SE,FT,Director of Data Engineering,200000,USD,US,100,US,L
3993,2021,EN,FT,Data Scientist,4000,USD,VN,0,VN,M
4007,2021,EX,FT,Principal Data Engineer,600000,USD,US,100,US,L
4210,2022,MI,FT,NLP Engineer,240000,CNY,US,50,US,L

In [16]:
def convert_to_categorical(df, variable):
    dummies = pd.get_dummies(df[variable], dtype='int',drop_first=False)
    dummies = dummies.rename(columns=lambda x: f"{x}")
    df = pd.concat([df, dummies], axis=1)
    df = df.drop([variable], axis="columns")
    return df

In [17]:
variables_categoricals = ['experience_level','salary_currency', 'employment_type', 'job_title','employee_residence','company_location','remote_ratio','company_size']

df_dummies = df
for v in variables_categoricals:
    df_dummies = convert_to_categorical(df_dummies, v)
df_dummies

,work_year,salary,EN,EX,MI,SE,AUD,BRL,CAD,CHF,...,TR,UA,US,VN,0,50,100,L,M,S
0,2023,80000,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,1,1,0,0
1,2023,30000,0,0,1,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,1
2,2023,25500,0,0,1,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,1
3,2023,175000,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,1,0,1,0
4,2023,120000,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3940,2021,4000,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,1,0,1,0
3987,2021,200000,0,0,0,1,0,0,0,0,...,0,0,1,0,0,0,1,1,0,0
3993,2021,4000,1,0,0,0,0,0,0,0,...,0,0,0,1,1,0,0,0,1,0
4007,2021,600000,0,1,0,0,0,0,0,0,...,0,0,1,0,0,0,1,1,0,0
4210,2022,240000,0,0,1,0,0,0,0,0,...,0,0,1,0,0,1,0,1,0,0

In [18]:
from sklearn.preprocessing import StandardScaler

target_att = 'salary'
attributes = [k for k in df.keys() if k!= target_att]
def normalize_SS(data):
    X = data[attributes]
    y = data[[target_att]]
    sc = StandardScaler()
    X_norm = sc.fit_transform(X)
    y_norm = sc.fit_transform(y)
    return [y_norm, X_norm]

def normalize_log(data):
    df_m = data+1 # Sumamos 1 porque para normalizar con log no podemos tener 0
    df_log = np.log(df_m)
    df_normalized = (df_log - df_log.min()) / (df_log.max() - df_log.min())
    df_normalized
    X_norm = df_normalized[attributes].to_numpy()
    y_norm = df_normalized[[target_att]].to_numpy()
    return [y_norm, X_norm]